# utilities
brew "awscli"
brew "bat" # better cat
brew "cmatrix" # some silly bs
brew "direnv" # directory specific environment variables
brew "docker-credential-helper"
brew "dvc" # data version control
brew "fribidi" # required for textshaping (R package)
brew "gdal" # geospatial data
brew "gh"
brew "harfbuzz" # required for textshaping (R package)
brew "htop"
brew "jq"
brew "node"
brew "openapi-generator"
brew "ponysay" # some silly bs
# brew "powerlevel10k" # my zsh theme
brew "pulumi" # infrastructure as code
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3"
brew "r"
brew "speedtest-cli"
brew "sqlite"
brew "thefuck" # correct cli typos
brew "tippecanoe" # vector tiles from geojson
brew "tldr" # better man pages
brew "tree" # recursive ls 
brew "udunits"
brew "uv" # python dependency management in Rust
# brew "uvicorn" # a webserver
# brew "vim" # text editing
brew "vite" 
brew "wget"


# third-party apps
# cask "1password"
# cask "1password-cli"
# cask "alfred"
# cask "brave-browser"
# cask "dbeaver-community"
# cask "docker"
# cask "dropbox"
# cask "firefox"
# cask "font-meslo-for-powerlevel10k"
# cask "google-chrome"
# cask "iterm2"
# cask "kodi"
# cask "microsoft-office"
# cask "miniforge"
# cask "postman"
# cask "protonvpn"
# cask "qbittorrent"
# cask "rstudio"
# cask "slack"
# cask "visual-studio-code"
# cask "vlc"
# cask "witch"
# cask "xquartz"
# cask "zoom"

# vscode extentions
# vscode "christian-kohler.path-intellisense"
# vscode "donjayamanne.python-environment-manager"
# vscode "iterative.dvc"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.remote-explorer"
# vscode "redhat.vscode-yaml"
# vscode "ryuta46.multi-command"
# vscode "vscodevim.vim"
# vscode "jojoee.conda-cheatsheet"
